v2112/DPMFoam/0/nut.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    inlet
    {
		type			calculated;
		value			$internalField;
    }
    outlet
    {
		type			calculated;
		value			$internalField;
    }
    upperAtm
    {
        type            zeroGradient;
    }
    ground
    {
        type            zeroGradient;
    }
    frontAtm
    {
		type			cyclic;
    }
    backAtm
    {
		type			cyclic;
    }
}


// ************************************************************************* //
