v2112/DPMFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          4096;
        startFace       774144;
    }
    outlet
    {
        type            patch;
        nFaces          4096;
        startFace       778240;
    }
    upperAtm
    {
        type            patch;
        nFaces          4096;
        startFace       782336;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4096;
        startFace       786432;
    }
    frontAtm
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4096;
        startFace       790528;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  backAtm;
    }
    backAtm
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4096;
        startFace       794624;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  frontAtm;
    }
)

// ************************************************************************* //
